reversing/xorpd-book.org
#+TITLE: Inspecting xorpd's assembly snippets
#+AUTHOR: 8dcc
#+STARTUP: nofold
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="../img/favicon.png" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />
#+HTML_LINK_UP: index.html
#+HTML_LINK_HOME: ../index.html

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

This is an analysis of each assembly snippet from the book "[[https://www.xorpd.net/pages/xchg_rax/snip_00.html][xchg rax, rax]]" by
[[https://www.xorpd.net/][xorpd]]. The book consists of 64 very original assembly snippets. It can be bought
physically for a low price and it can be a good gift for some assembly nerd you
might know.

If you want to try and figure out the snippets for yourself, I recommend you
have the following manuals around:

- Intel Software Developer Manual (SDM), specially volume 2. See the [[file:../reference/index.org::#intel-manuals][Intel SDM]]
  section on the reference index for more information.
- The [[https://www.nasm.us/doc/][NASM manual]], since it's the syntax used by the author of the book.

* Snippets
:PROPERTIES:
:CUSTOM_ID: snippets
:END:

Each subsection will correspond to a different snippet from the book.

I took the liberty of modifying some indentation/spacing to fit my own
preferences.

** Snippet 00
:PROPERTIES:
:CUSTOM_ID: snippet-00
:END:

Different ways of setting a register to zero.

#+begin_src nasm
    xor      eax, eax
    lea      rbx, [0]
    loop     $
    mov      rdx, 0
    and      esi, 0
    sub      edi, edi
    push     0
    pop      rbp
#+end_src

Note how =[0]= doesn't refer to the value at address 0, it simply indicates that 0
is an /effective address/. Some instructions, like =mov=, operate on the value at
the address (effectively "dereferencing" it); but some others, like =lea=, operate
on the address itself, loading it into the specified register. See section 3.3
(Effective Addresses) of the [[https://www.nasm.us/xdoc/2.14.02/html/nasmdoc3.html#section-3.3][NASM manual]].

The =loop= instruction decrements the count register (=rcx=) and, if it's not zero,
jumps to the target operand. In this case, the operand is =$=, which in NASM
refers to the address of the current instruction. See section 3.5 (Expressions)
of the [[https://www.nasm.us/doc/nasmdoc3.html#section-3.5][NASM manual]].

** Snippet 01
:PROPERTIES:
:CUSTOM_ID: snippet-01
:END:

Calculate [[https://en.wikipedia.org/wiki/Fibonacci_sequence][Fibonacci]] or [[https://en.wikipedia.org/wiki/Lucas_number][Lucas]] sequences.

#+begin_src nasm
.loop:
    xadd     rax, rdx
    loop     .loop
#+end_src

The =xadd= instruction exchanges values in the first and second operand (like
=xchg=) and stores the sum of the two values in the first operand. In this case it
will exchange the values at =rax= and =rdx=, and save the sum in =rax=. Because of the
=loop= instruction, this process will be repeated =rcx= times.

Using the =xadd= instruction on the same registers over and over can be used to
generate Fibonacci or similar sequences. For example:

| Iteration | =rax= | =rdx= |
|-----------+-----+-----+
|         0 |   1 |   0 |
|         1 |   1 |   1 |
|         2 |   2 |   1 |
|         3 |   3 |   2 |
|         4 |   5 |   3 |

As you can see, the value in each register is the sum of the values that were in
that register in the previous two iterations.

By changing the initial state of the registers, the Lucas sequence can be
generated:

| Sequence  | Initial =rax= | Initial =rdx= |
|-----------+-------------+-------------|
| Fibonacci |           1 |           0 |
| Lucas     |           1 |           2 |

