reversing/xorpd-book.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inspecting xorpd's assembly snippets</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Inspecting xorpd&rsquo;s assembly snippets</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#snippets">2. Snippets</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
This is an analysis of each assembly snippet from the book &ldquo;<a href="https://www.xorpd.net/pages/xchg_rax/snip_00.html">xchg rax, rax</a>&rdquo; by
<a href="https://www.xorpd.net/">xorpd</a>. The book consists of 64 very original assembly snippets. It can be bought
physically for a low price and it can be a good gift for some assembly nerd you
might know.
</p>

<p>
If you want to try and figure out the snippets for yourself, I recommend you
have the following manuals around:
</p>

<ul class="org-ul">
<li>Intel Software Developer Manual (SDM), specially volume 2. See the
<a href="index.html#intel-manuals">Intel manuals</a> section on the reverse engineering index for more information.</li>
<li>The <a href="https://www.nasm.us/doc/">NASM manual</a>, since it&rsquo;s the syntax used by the author of the book.</li>
</ul>
</div>
</div>

<div id="outline-container-snippets" class="outline-2">
<h2 id="snippets"><span class="section-number-2">2.</span> Snippets</h2>
<div class="outline-text-2" id="text-snippets">
<p>
Each subsection will correspond to a different snippet from the book.
</p>

<p>
I took the liberty of modifying some indentation/spacing to fit my own
preferences.
</p>
</div>

<div id="outline-container-snippet-00" class="outline-3">
<h3 id="snippet-00"><span class="section-number-3">2.1.</span> Snippet 00</h3>
<div class="outline-text-3" id="text-snippet-00">
<p>
Different ways of setting a register to zero.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #feacd0;">xor</span>      <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
<span style="color: #feacd0;">lea</span>      <span style="color: #6ae4b9;">rbx</span>, [<span style="color: #88ca9f;">0</span>]
<span style="color: #feacd0;">loop</span>     $
<span style="color: #feacd0;">mov</span>      <span style="color: #6ae4b9;">rdx</span>, <span style="color: #88ca9f;">0</span>
<span style="color: #feacd0;">and</span>      <span style="color: #6ae4b9;">esi</span>, <span style="color: #88ca9f;">0</span>
<span style="color: #feacd0;">sub</span>      <span style="color: #6ae4b9;">edi</span>, <span style="color: #6ae4b9;">edi</span>
<span style="color: #feacd0;">push</span>     <span style="color: #88ca9f;">0</span>
<span style="color: #feacd0;">pop</span>      <span style="color: #6ae4b9;">rbp</span>
</pre>
</div>

<p>
Note how <code>[0]</code> doesn&rsquo;t refer to the value at address 0, it simply indicates that 0
is an <i>effective address</i>. Some instructions, like <code>mov</code>, operate on the value at
the address (effectively &ldquo;dereferencing&rdquo; it); but some others, like <code>lea</code>, operate
on the address itself, loading it into the specified register. See section 3.3
(Effective Addresses) of the <a href="https://www.nasm.us/xdoc/2.14.02/html/nasmdoc3.html#section-3.3">NASM manual</a>.
</p>

<p>
The <code>loop</code> instruction decrements the count register (<code>rcx</code>) and, if it&rsquo;s not zero,
jumps to the target operand. In this case, the operand is <code>$</code>, which in NASM
refers to the address of the current instruction. See section 3.5 (Expressions)
of the <a href="https://www.nasm.us/doc/nasmdoc3.html#section-3.5">NASM manual</a>.
</p>
</div>
</div>

<div id="outline-container-snippet-01" class="outline-3">
<h3 id="snippet-01"><span class="section-number-3">2.2.</span> Snippet 01</h3>
<div class="outline-text-3" id="text-snippet-01">
<p>
Calculate <a href="https://en.wikipedia.org/wiki/Fibonacci_sequence">Fibonacci</a> or <a href="https://en.wikipedia.org/wiki/Lucas_number">Lucas</a> sequences.
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">.loop</span>:
    <span style="color: #feacd0;">xadd</span>     <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rdx</span>
    <span style="color: #feacd0;">loop</span>     .loop
</pre>
</div>

<p>
The <code>xadd</code> instruction exchanges values in the first and second operand (like
<code>xchg</code>) and stores the sum of the two values in the first operand. In this case it
will exchange the values at <code>rax</code> and <code>rdx</code>, and save the sum in <code>rax</code>. Because of the
<code>loop</code> instruction, this process will be repeated <code>rcx</code> times.
</p>

<p>
Using the <code>xadd</code> instruction on the same registers over and over can be used to
generate Fibonacci or similar sequences. For example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Iteration</th>
<th scope="col" class="org-right"><code>rax</code></th>
<th scope="col" class="org-right"><code>rdx</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
As you can see, the value in each register is the sum of the values that were in
that register in the previous two iterations.
</p>

<p>
By changing the initial state of the registers, the Lucas sequence can be
generated:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sequence</th>
<th scope="col" class="org-right">Initial <code>rax</code></th>
<th scope="col" class="org-right">Initial <code>rdx</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Fibonacci</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Lucas</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>
</div>
